# 1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.
n = int(input("შეიყვანეთ რიცხვი: "))

# ვქმნით საწყის ცვლადს, სადაც შევინახავთ ჯამს
total_sum = 0
for i in range(1, n + 1):
    total_sum += i 
print("1-დან", n, "-მდე რიცხვების ჯამია:", total_sum)

# 2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

number = int(input("შეიყვანეთ რიცხვი: "))

while number > 0:
    print(number)
    number -= 1  


# 3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

secret_number = 7  

while True:
    guess = int(input("გამოიცანით რიცხვი: "))
    
    if guess == secret_number:
        print("გილოცავთ! თქვენ გამოიცანით სწორი რიცხვი.")
        break  
    else:
        print("არასწორია, სცადეთ თავიდან!")


# 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

total_sum = 0

while True:
    user_input = input("შეიყვანეთ რიცხვი (ან დაწერეთ 'sum' დასასრულებლად): ")
    
    if user_input.lower() == 'sum':
        break
    
    number = int(user_input)

    if number > 0:
        total_sum += number

print("შემოყვანილი დადებითი რიცხვების ჯამია:", total_sum)