# 1. კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).

num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))


print("მიმატება:", num1 + num2)
print("გამოკლება:", num1 - num2)
print("გამრავლება:", num1 * num2)
print("ჩვეულებრივი გაყოფა:", num1 / num2)
print("მთელზე გაყოფა:", num1 // num2)
print("ნაშთი:", num1 % num2)
print("ახარისხება:", num1 ** num2)



# 2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

d1 = int(input("შეიყვანეთ პირველი დიაგონალი: "))
d2 = int(input("შეიყვანეთ მეორე დიაგონალი: "))

area = (d1 * d2) / 2

print("რომბის ფართობია:", area)

# 3. მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

meters = int(input("შეიყვანეთ მეტრების რაოდენობა: "))

print("სანტიმეტრებში:", meters * 100)
print("დეციმეტრებში:", meters * 10)
print("მილიმეტრებში:", meters * 1000)
print("მილში:", meters * 0.000621371)

#  კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.

number = int(input("შეიყვანეთ ორნიშნა რიცხვი: "))

first_digit = number // 10
second_digit = number % 10
total_sum = first_digit + second_digit

print("ციფრთა ჯამია:", total_sum)